import React from "react";
import styled from "styled-components";
import CodeEditor from "@uiw/react-textarea-code-editor";
import Tag from "./Tag";
import { motion } from "framer-motion";

export default function Wb1() {
    return (
        <Wrapper
            initial={{ opacity: 0, x: "-100%"}}
            animate={{ opacity: 1, x: "0"}}
            transition={{ duration: 0.5 }}
        >
            <Title>1. Вступ в HTML</Title>
            <Start>
                <img
                    src="/images/1_q99J7XLYVWgOt69E8IuXqw.gif"
                    alt="web structure"
                />
                <p>
                    HTML, CSS і JS - це три основні складові твоєї будівлі.
                    <br />
                    <br />
                    1. <b>HTML</b>: Це основа, основний каркас твоєї будівлі.
                    HTML - це як фундамент, на якому спирається будь-яка
                    сторінка в Інтернеті. Він визначає, як буде структурована
                    твоя сторінка, де будуть розташовані різні частини:
                    заголовки, текст, зображення і так далі.
                    <br />
                    <br />
                    2. <b>CSS</b>: Це як красиве оздоблення твоєї будівлі. CSS
                    відповідає за зовнішній вигляд - колір стін, розмір вікон,
                    стиль дверей. Він робить твою сторінку гарною та привабливою
                    для очей. <br />
                    <br />
                    3. <b>JS (JavaScript)</b>: Це як магія, яка робить твою
                    будівлю живою. JS додає різні цікаві функції, можливості для
                    взаємодії - як рухаються двері, чи можна відкривати вікна.
                    Він надає можливість робити сторінку динамічною та цікавою
                    для користувачів. <br />
                    <br />
                    Отже, коли ми говоримо про створення веб-сторінок, HTML
                    відповідає за структуру, CSS - за зовнішній вигляд, а JS
                    додає різноманітні можливості та інтерактивність. Ці три
                    речі разом створюють круту та функціональну веб-сторінку.
                </p>
            </Start>
            <h2>Тег - цеглинки будинку HTML</h2>
            <div>
                <Ttag utag={"h1"} attrs={`атрибут="значення"`}>
                    Контент
                </Ttag>
                <p>
                    Теги бувають парними і непарними. Вище зображений парний
                    тег. h1 - це його назва, в залежності від назви вміст тегу
                    впливає на стилі і функціонал вмісту. Атрибут це
                    доналаштування тегу, вони є не обов'язковими і можуть мати
                    значення для більш точного налаштування, атрибути пишуться
                    тільки в відкриваючому тегу.
                </p>
            </div>
            <h2>Основна структура HTML документу</h2>
            <CodeEditor
                value={`
                <!DOCTYPE html>
                <html lang="en">
                <head>
                    <meta charset="UTF-8">
                    <title>Document</title>
                </head>
                <body>
                    
                </body>
                </html>
            `}
                language="html"
                style={{ fontSize: "1rem" }}
            />
            <ol>
                <li>
                    <Tag utag={"!DOCTYPE"} pair={false} attrs={`html`} /> - Це
                    декларація типу документа. Вказує браузеру на версію HTML,
                    яку використовує цей документ. Він визначає, що це HTML5 -
                    остання версія мови розмітки HTML.
                </li>
                <li>
                    <Tag utag={"html"} attrs={`lang="en"`} /> - Відкриває
                    кореневий елемент HTML-документа і вказує мову документа
                    (`lang="en"` - англійська). Весь HTML-код знаходиться
                    всередині цього тегу.
                </li>
                <li>
                    <Tag utag={"head"} /> - Це контейнер для метаданих
                    HTML-документа, таких як заголовок документа, підключення
                    стилів, скриптів, метатеги для пошукових систем тощо. Ця
                    частина не відображається на сторінці.
                </li>
                <li>
                    <Tag utag={"body"} /> - Відкриває тег тіла документа. Усе,
                    що робиться для відображення на сторінці, зазвичай
                    розміщується всередині цього тегу, такий як текст,
                    зображення, таблиці, форми, скрипти і т.д.
                </li>
                <li>
                    <Tag utag={"meta"} attrs={`charset="UTF-8"`} /> - Вказує
                    кодування символів, яке використовується для тексту на
                    сторінці. `UTF-8` - це тип кодування, який підтримує багато
                    різних символів і мов.
                </li>
                <li>
                    <Tag utag={"title"} /> - Визначає заголовок документа, який
                    відображається в рядку заголовка браузера або в закладці.
                    Вміст між відкриваючим і закриваючим тегами це заголовок
                    сторінки.
                </li>
            </ol>
            <h2>Текстові та заголовкові теги</h2>
            <div style={{ textAlign: "center" }}>
                <Tag tag={"h1"}>Головний заголовок</Tag>
                <Tag tag={"h2"}>Під заголовок заголовок</Tag>
                <Tag tag={"h3"}>Під під заголовок заголовок</Tag>
                <Tag tag={"h4"}>Під під під заголовок заголовок</Tag>
                <Tag tag={"h5"}>Під під під під заголовок заголовок</Tag>
                <Tag tag={"h6"}>Під під під під під заголовок заголовок</Tag>
            </div>
            <p>
                <Tag utag={"h1"} /> Це найбільший заголовок. Використовується
                для основного заголовку сторінки або секції. <br />
                <Tag utag={"h2"} /> Це заголовок, менший за h1, але все ще
                досить великий. Використовується для підзаголовків або для
                відокремлення розділів на сторінці. <br />
                <Tag utag={"h3"} /> Це заголовок третього рівня.
                Використовується для ще більш дрібних розділів або підзаголовків
                всередині секцій. <br />
                <Tag utag={"h4"} />, <Tag utag={"h5"} />, <Tag utag={"h6"} /> Це
                заголовки з меншим рівнем важливості порівняно з попередніми. h4
                використовується для менших підрозділів, а h5 і h6 - ще менших
                за розміром заголовки.
            </p>
            <p>
                Абзац: Тег <Tag utag={"p"} /> - це маленька скринька для тексту.
                Коли ти хочеш написати кілька речень, або згрупувати текст, щоб
                він виглядав більш організовано, тег
                <Tag utag={"p"} /> тобі у цьому допоможе. Один після одного: Він
                допомагає відокремити один абзац від іншого. Якщо ти пишеш
                розповідь, кожен новий абзац - це як нова частина твоєї історії.
                Організація тексту: Цей тег робить текст краще виглядаючим,
                допомагаючи розташувати речення та ідеї так, щоб було зручно
                читати.
            </p>
            <h2>Теги форматування тексту</h2>
            <ol>
                <li>
                    <Tag tag={"b"}>Bold</Tag> або{" "}
                    <Tag tag={"strong"}>Strong</Tag> ці теги створюють жирний
                    текст. Якщо ти хочеш, щоб слова були більш виділені або
                    виглядали більш важливо.
                </li>
                <li>
                    <Tag tag={"i"}>Italic</Tag> цей нахиляє текст. Якщо ти
                    хочеш, щоб слова були нахиленими або виглядали як курсив
                </li>
                <li>
                    <Tag tag={"u"}>Underline</Tag> цей підкреслює текст
                </li>
                <li>
                    <Tag tag={"sup"}>Superscript</Tag> цей робить вміст верхнім
                    індексом
                </li>
                <li>
                    <Tag tag={"sub"}>Subscript</Tag> цей робить вміст нижнім
                    індексом
                </li>
            </ol>
            <p>
                Ці теги допомагають виділяти слова або змінювати їхній вигляд,
                щоб зробити текст цікавішим та зрозумілішим. Наприклад, можна
                підкреслити важливі слова, зробити текст нахиленим, жирним або
                навіть додати числа у верхньому або нижньому рядках.
            </p>
        </Wrapper>
    );
}

let Wrapper = styled(motion.div)`
    display: flex;
    flex-direction: column;
    gap: 1rem;
`;

let Title = styled.h1`
    text-align: center;
    font-family: "title", sans-serif;
    font-size: 3rem;
`;

let Start = styled.div`
    display: flex;
    gap: 1rem;
`;

let Ttag = styled(Tag)`
    text-align: center;
    font-size: 3rem;
    display: block;
`;
